#include<stdio.h>
#include<string.h>

//제산법
int h(int key)
{
	return key % 229;
}

//이중해싱의 step함수
int step(int key)
{
	return 31 - (key % 31);
}

int main() {

	int key[] = { 512, 1, 513, 515, 4, 6, 7, 522, 524, 13, 525, 527, 535, 536, 541, 557, 560, 50, 56, 571, 574, 577, 580, 68, 583, 72, 77, 79, 81, 601, 89, 613, 614, 616, 110, 113, 628, 116, 121, 130, 135, 654, 658, 163, 677, 681, 173, 686, 692, 182, 705, 194, 716, 205, 722, 727, 217, 730, 734, 226, 742, 743, 753, 755, 757, 245, 252, 265, 778, 268, 274, 275, 795, 798, 301, 817, 818, 307, 829, 831, 833, 321, 324, 332, 845, 339, 342, 854, 858, 348, 353, 354, 360, 361, 362, 876, 365, 881, 376, 888, 894, 895, 896, 897, 387, 389, 390, 395, 398, 911, 913, 407, 920, 921, 412, 925, 418, 932, 936, 937, 940, 434, 439, 442, 956, 446, 958, 449, 968, 970, 461, 463, 977, 992, 491, 496, 503 };
	int table[229] = { 0, };

	

	for (int i = 0; i < 137; i++) {
		int j = h(key[i]);
		if (table[j] == 0) { // 저장
			table[j] = key[i];
		}
		else { // 충돌이 발생한 경우
			int n = 1;
			while (1) {
				int k = h(h(key) + n * step(key)); // 이중해싱 적용
				if (table[k] == 0) { // 저장
					table[k] = key[i];
					break;
				}
				if (n > 229)
					break; // escape code
				n++;
			}
		}
	}

	printf("key값(137개):\n");
	for (int i = 0; i < 137; i++) {
		printf("%d, ", key[i]);
		if (i == 136)
			printf("%d\n", key[i]);
	}
	printf("\n\n\n");

	printf("========================================================================================\n\n");
	printf("k mod M에서 Hash Table 사이즈인 M의 값은 229로 설정했습니다.\n");
	printf("자료가 모두 다 들어가도 용량의 60%만 차지할 수 있도록 계산하여 소수인 229로 설정했습니다.\n\n");
	printf("Double hashing을 위한 해시 함수의 step은 31 - (k mod 31)로 했습니다.\n");
	printf("31로 설정한 이유는, key값이 0부터 999까지 1000개의 숫자 중 무작위로 선정된 점을 고려하여,\n루트 1000을 했더니 31이 나왔기 때문입니다.\n\n");
	printf("=========================================================================================\n\n\n");

	printf("hash table(229개의 자리):\n");
	for (int i = 0; i < 229; i++) {
		if (i == 228) {
			printf("%d\n", table[i]);
			break;
		}
		printf("%d, ", table[i]);
	}
	printf("\n\n\n");

	int cnt = 0;
	printf("hash table에 들어간 자료의 개수: ");
	for (int i = 0; i < 229; i++) {
		if (table[i] != 0) {
			cnt++;
		}
	}
	printf("%d\n", cnt);

	printf("Hash Table에서 911의 주소: ");
	for (int i = 0; i < 229; i++) {
		if (table[i] == 911) {
			printf("%d\n\n", i);
		}
	}

	system("pause");
	return 0;
}